
#顯示菜單
def show_menu():
    print("+---------------------------------+")
    print("|   (1) 添加學生訊息              |")
    print("|   (2) 查看所有學生訊息          |")
    print("|   (3) 修改學生的成績            |")
    print("|   (4) 刪除學生訊息              |")
    print("|   (5) 成績,年齡排序             |")
    print("|   (6) 保存信息到文件(si.txt)    |")
    print("|   (7) 從文件中讀取數據(si.txt)  |")
    print("|   (q) 退出                      |")
    print("+---------------------------------+")



#5)成績,年齡排序,顯示
def Order_Windows():
    print("+--------------------------------+")
    print("|   1- 成績:大到小                |")
    print("|   2- 成績:小到大                |")
    print("|   3- 年齡:大到小                |")
    print("|   4- 年齡:小到大                |")
    print("|   q) 退出                       |")
    print("+--------------------------------+")